# Referenties

Altijd beginnen met 'getting started':

https://pandas.pydata.org/docs/getting_started/index.html#getting-started

Dan een snel overzicht:

https://pandas.pydata.org/docs/user_guide/10min.html

Daarna kijken naar de API beschrijving:

https://pandas.pydata.org/docs/reference/index.html

# Installatie

Run `pip3 install pandas` in the terminal to install the Pandas library.

# Imports

In [3]:
import pandas as pd

import matplotlib.pyplot as plt

# Schetsen

In [83]:
# Dataframe maken
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [
            22,
            35,
            58
        ],
        "Sex": [
            "male",
            "male",
            "female"
        ],
    }
    # ,
    # index = ["a", "b", "c"]
)

# Standaard print
print(df)

# Vergelijk met
display(df)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [84]:
# Data opslaan
df.to_csv('./persons.csv', header=True, index=False)

In [85]:
# Data inleze
df_saved = pd.read_csv('./persons.csv')

display(df_saved)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [86]:
# De kolomnaam

# display(df["Age"])

display(df.Age)

type(df["Age"])

0    22
1    35
2    58
Name: Age, dtype: int64

pandas.core.series.Series

In [87]:
# Een kolom lezen

display(df.Name)

age = "Age"
df[age]

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

0    22
1    35
2    58
Name: Age, dtype: int64

In [88]:
# Een kolom verwijderen
df_copy = df.copy()
co1 = df_copy.pop("Age")

display(co1)
display(df_copy)
display(df)

0    22
1    35
2    58
Name: Age, dtype: int64

                       Name     Sex
0   Braund, Mr. Owen Harris    male
1  Allen, Mr. William Henry    male
2  Bonnell, Miss. Elizabeth  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [89]:
df_copy = df.copy()
df_copy_copy = df_copy.drop("Age", axis=1)

display(df_copy)
display(df_copy_copy)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name     Sex
0   Braund, Mr. Owen Harris    male
1  Allen, Mr. William Henry    male
2  Bonnell, Miss. Elizabeth  female

In [94]:
# Een rij lezen
df.loc["a"]["Age"]

KeyError: 'a'

In [91]:
# Functie getRow() maken
def getrow(dataframe, index):
    
    return dataframe.iloc[index]

getrow(df, 2)

Name    Bonnell, Miss. Elizabeth
Age                           58
Sex                       female
Name: 2, dtype: object

In [101]:
# Een rij toevoegen
df_copy = df.copy()

# Does not work as expected!!!
# df_copy.add(["Ruud", 44, "male"], axis=0)

df_copy.loc[3] = ["Ruud", 44 ,"male"]
df_copy.loc[.25] = ["Ruud", 44 ,"male"]

df_copy_copy = df_copy.sort_index().reset_index(drop=True)

display(df_copy)
display(df_copy_copy)

# pd.concat([df_copy, ["Hans", 54, "male"]])

                          Name  Age     Sex
0.00   Braund, Mr. Owen Harris   22    male
1.00  Allen, Mr. William Henry   35    male
2.00  Bonnell, Miss. Elizabeth   58  female
3.00                      Ruud   44    male
0.25                      Ruud   44    male

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1                      Ruud   44    male
2  Allen, Mr. William Henry   35    male
3  Bonnell, Miss. Elizabeth   58  female
4                      Ruud   44    male

In [102]:
# Functie insertAt(row, index)
# ...

In [103]:
# Verkennen
# ...

In [114]:
# Filteren
df.query("Age > 30 and Sex == 'male'")

mss = df.query(" Name == 'Bonnell, Miss. Elizabeth'")

mss["Sex"]

                       Name  Age   Sex
1  Allen, Mr. William Henry   35  male

In [119]:
df["Age"] > 30

0    False
1     True
2     True
Name: Age, dtype: bool

In [120]:
df[df["Age"] > 30]

                       Name  Age     Sex
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [123]:
df[df["Name"].str.contains("B")]

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
2  Bonnell, Miss. Elizabeth   58  female

In [136]:
# Groeperen
# ...

In [137]:
# Extra: toepassing OOP en het bouwen van je eigen library
# ...